<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Introduction" data-toc-modified-id="Introduction-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Introduction</a></span></li><li><span><a href="#Installation" data-toc-modified-id="Installation-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Installation</a></span></li><li><span><a href="#Introduction-to-pandas-data-structures" data-toc-modified-id="Introduction-to-pandas-data-structures-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Introduction to pandas data structures</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#Dataframes" data-toc-modified-id="Dataframes-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Dataframes</a></span><ul class="toc-item"><li><span><a href="#From-data-types" data-toc-modified-id="From-data-types-3.2.1"><span class="toc-item-num">3.2.1&nbsp;&nbsp;</span>From data types</a></span></li><li><span><a href="#From-path" data-toc-modified-id="From-path-3.2.2"><span class="toc-item-num">3.2.2&nbsp;&nbsp;</span>From path</a></span></li><li><span><a href="#From-databases" data-toc-modified-id="From-databases-3.2.3"><span class="toc-item-num">3.2.3&nbsp;&nbsp;</span>From databases</a></span></li></ul></li></ul></li><li><span><a href="#Exploratory-analysis-of-a-dataframe" data-toc-modified-id="Exploratory-analysis-of-a-dataframe-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Exploratory analysis of a dataframe</a></span><ul class="toc-item"><li><span><a href="#Meta-information" data-toc-modified-id="Meta-information-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Meta information</a></span></li><li><span><a href="#Previsualization" data-toc-modified-id="Previsualization-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Previsualization</a></span></li><li><span><a href="#NaN-values" data-toc-modified-id="NaN-values-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>NaN values</a></span></li><li><span><a href="#Basic-descriptive-statistics" data-toc-modified-id="Basic-descriptive-statistics-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>Basic descriptive statistics</a></span></li></ul></li><li><span><a href="#Basic-operations-with-dataframes" data-toc-modified-id="Basic-operations-with-dataframes-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Basic operations with dataframes</a></span><ul class="toc-item"><li><span><a href="#Select:-column" data-toc-modified-id="Select:-column-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>Select: column</a></span></li><li><span><a href="#Select:-subset" data-toc-modified-id="Select:-subset-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>Select: subset</a></span></li><li><span><a href="#Get-the-unique-values-​​of-a-column" data-toc-modified-id="Get-the-unique-values-​​of-a-column-5.3"><span class="toc-item-num">5.3&nbsp;&nbsp;</span>Get the unique values ​​of a column</a></span></li><li><span><a href="#Filter-based-on-condition" data-toc-modified-id="Filter-based-on-condition-5.4"><span class="toc-item-num">5.4&nbsp;&nbsp;</span>Filter based on condition</a></span></li><li><span><a href="#Change-the-data-type-of-a-column" data-toc-modified-id="Change-the-data-type-of-a-column-5.5"><span class="toc-item-num">5.5&nbsp;&nbsp;</span>Change the data type of a column</a></span></li><li><span><a href="#We-filter-the-data-by-the-value-of-the-columns" data-toc-modified-id="We-filter-the-data-by-the-value-of-the-columns-5.6"><span class="toc-item-num">5.6&nbsp;&nbsp;</span>We filter the data by the value of the columns</a></span></li><li><span><a href="#Copy-a-dataframe-and-rename-columns" data-toc-modified-id="Copy-a-dataframe-and-rename-columns-5.7"><span class="toc-item-num">5.7&nbsp;&nbsp;</span>Copy a dataframe and rename columns</a></span><ul class="toc-item"><li><span><a href="#Rename-columns" data-toc-modified-id="Rename-columns-5.7.1"><span class="toc-item-num">5.7.1&nbsp;&nbsp;</span>Rename columns</a></span></li></ul></li><li><span><a href="#delete-columns" data-toc-modified-id="delete-columns-5.8"><span class="toc-item-num">5.8&nbsp;&nbsp;</span>delete columns</a></span></li><li><span><a href="#delete-rows" data-toc-modified-id="delete-rows-5.9"><span class="toc-item-num">5.9&nbsp;&nbsp;</span>delete rows</a></span></li><li><span><a href="#setting-the-index" data-toc-modified-id="setting-the-index-5.10"><span class="toc-item-num">5.10&nbsp;&nbsp;</span>setting the index</a></span></li><li><span><a href="#Operations-between-columns" data-toc-modified-id="Operations-between-columns-5.11"><span class="toc-item-num">5.11&nbsp;&nbsp;</span>Operations between columns</a></span></li></ul></li><li><span><a href="#Apply-!" data-toc-modified-id="Apply-!-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Apply !</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Passing-a-map-or-an-apply" data-toc-modified-id="Passing-a-map-or-an-apply-6.0.1"><span class="toc-item-num">6.0.1&nbsp;&nbsp;</span>Passing a map or an apply</a></span></li><li><span><a href="#Receive:" data-toc-modified-id="Receive:-6.0.2"><span class="toc-item-num">6.0.2&nbsp;&nbsp;</span>Receive:</a></span></li></ul></li></ul></li><li><span><a href="#Df-.loc-&amp;-.iloc" data-toc-modified-id="Df-.loc-&amp;-.iloc-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Df .loc &amp; .iloc</a></span><ul class="toc-item"><li><span><a href="#Select-rows-and-columns-in-Pandas-by-position-with-iloc" data-toc-modified-id="Select-rows-and-columns-in-Pandas-by-position-with-iloc-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>Select rows and columns in Pandas by position with iloc</a></span></li><li><span><a href="#Select-rows-and-columns-in-Pandas-based-on-labels-with-loc" data-toc-modified-id="Select-rows-and-columns-in-Pandas-based-on-labels-with-loc-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>Select rows and columns in Pandas based on labels with loc</a></span><ul class="toc-item"><li><span><a href="#Based-on-label" data-toc-modified-id="Based-on-label-7.2.1"><span class="toc-item-num">7.2.1&nbsp;&nbsp;</span>Based on label</a></span></li></ul></li></ul></li><li><span><a href="#Order-a-dataframe" data-toc-modified-id="Order-a-dataframe-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Order a dataframe</a></span></li><li><span><a href="#Null-values" data-toc-modified-id="Null-values-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Null values</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#It-is-null?" data-toc-modified-id="It-is-null?-9.0.1"><span class="toc-item-num">9.0.1&nbsp;&nbsp;</span>It is null?</a></span></li><li><span><a href="#Is-NOT-null?" data-toc-modified-id="Is-NOT-null?-9.0.2"><span class="toc-item-num">9.0.2&nbsp;&nbsp;</span>Is NOT null?</a></span></li><li><span><a href="#Sum-the-null-values-​​of-each-column" data-toc-modified-id="Sum-the-null-values-​​of-each-column-9.0.3"><span class="toc-item-num">9.0.3&nbsp;&nbsp;</span>Sum the null values ​​of each column</a></span></li></ul></li><li><span><a href="#delete-null-values" data-toc-modified-id="delete-null-values-9.1"><span class="toc-item-num">9.1&nbsp;&nbsp;</span>delete null values</a></span></li><li><span><a href="#How-to-fill-in-the-missing-data" data-toc-modified-id="How-to-fill-in-the-missing-data-9.2"><span class="toc-item-num">9.2&nbsp;&nbsp;</span>How to fill in the missing data</a></span></li></ul></li><li><span><a href="#We-delete-the-duplicates" data-toc-modified-id="We-delete-the-duplicates-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>We delete the duplicates</a></span></li><li><span><a href="#Data-aggregation" data-toc-modified-id="Data-aggregation-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>Data aggregation</a></span><ul class="toc-item"><li><span><a href="#groupby" data-toc-modified-id="groupby-11.1"><span class="toc-item-num">11.1&nbsp;&nbsp;</span>groupby</a></span><ul class="toc-item"><li><span><a href="#groupby-&amp;-aggregate" data-toc-modified-id="groupby-&amp;-aggregate-11.1.1"><span class="toc-item-num">11.1.1&nbsp;&nbsp;</span>groupby &amp; aggregate</a></span></li></ul></li><li><span><a href="#Pivot-Tables" data-toc-modified-id="Pivot-Tables-11.2"><span class="toc-item-num">11.2&nbsp;&nbsp;</span>Pivot Tables</a></span></li><li><span><a href="#Differences-between-pivot-table-and-groupby-function" data-toc-modified-id="Differences-between-pivot-table-and-groupby-function-11.3"><span class="toc-item-num">11.3&nbsp;&nbsp;</span>Differences between pivot table and groupby function</a></span></li><li><span><a href="#Crosstab-Function" data-toc-modified-id="Crosstab-Function-11.4"><span class="toc-item-num">11.4&nbsp;&nbsp;</span>Crosstab Function</a></span></li></ul></li><li><span><a href="#Data-combination:-mixing-dataframes" data-toc-modified-id="Data-combination:-mixing-dataframes-12"><span class="toc-item-num">12&nbsp;&nbsp;</span>Data combination: mixing dataframes</a></span><ul class="toc-item"><li><span><a href="#Concat" data-toc-modified-id="Concat-12.1"><span class="toc-item-num">12.1&nbsp;&nbsp;</span>Concat</a></span><ul class="toc-item"><li><span><a href="#Concatenating-on-axis-0-(rows)" data-toc-modified-id="Concatenating-on-axis-0-(rows)-12.1.1"><span class="toc-item-num">12.1.1&nbsp;&nbsp;</span>Concatenating on axis 0 (rows)</a></span></li><li><span><a href="#Concatenating-on-axis-1-(columns)" data-toc-modified-id="Concatenating-on-axis-1-(columns)-12.1.2"><span class="toc-item-num">12.1.2&nbsp;&nbsp;</span>Concatenating on axis 1 (columns)</a></span></li></ul></li><li><span><a href="#Merge" data-toc-modified-id="Merge-12.2"><span class="toc-item-num">12.2&nbsp;&nbsp;</span>Merge</a></span><ul class="toc-item"><li><span><a href="#LEFT-Merge" data-toc-modified-id="LEFT-Merge-12.2.1"><span class="toc-item-num">12.2.1&nbsp;&nbsp;</span>LEFT Merge</a></span></li><li><span><a href="#RIGHT-Merge" data-toc-modified-id="RIGHT-Merge-12.2.2"><span class="toc-item-num">12.2.2&nbsp;&nbsp;</span>RIGHT Merge</a></span></li><li><span><a href="#INNER-Merge" data-toc-modified-id="INNER-Merge-12.2.3"><span class="toc-item-num">12.2.3&nbsp;&nbsp;</span>INNER Merge</a></span></li><li><span><a href="#OUTER-Merge" data-toc-modified-id="OUTER-Merge-12.2.4"><span class="toc-item-num">12.2.4&nbsp;&nbsp;</span>OUTER Merge</a></span></li></ul></li><li><span><a href="#Merging-/-Concatenating-in-two-different-columns" data-toc-modified-id="Merging-/-Concatenating-in-two-different-columns-12.3"><span class="toc-item-num">12.3&nbsp;&nbsp;</span>Merging / Concatenating in two different columns</a></span><ul class="toc-item"><li><span><a href="#Concatenating-in-two-different-columns" data-toc-modified-id="Concatenating-in-two-different-columns-12.3.1"><span class="toc-item-num">12.3.1&nbsp;&nbsp;</span>Concatenating in two different columns</a></span></li><li><span><a href="#Merging-in-two-different-columns" data-toc-modified-id="Merging-in-two-different-columns-12.3.2"><span class="toc-item-num">12.3.2&nbsp;&nbsp;</span>Merging in two different columns</a></span></li></ul></li><li><span><a href="#Join" data-toc-modified-id="Join-12.4"><span class="toc-item-num">12.4&nbsp;&nbsp;</span>Join</a></span></li><li><span><a href="#Differences-between-join-&amp;-merge" data-toc-modified-id="Differences-between-join-&amp;-merge-12.5"><span class="toc-item-num">12.5&nbsp;&nbsp;</span>Differences between join &amp; merge</a></span></li></ul></li><li><span><a href="#Export-data" data-toc-modified-id="Export-data-13"><span class="toc-item-num">13&nbsp;&nbsp;</span>Export data</a></span></li><li><span><a href="#Pandas-usual-methods" data-toc-modified-id="Pandas-usual-methods-14"><span class="toc-item-num">14&nbsp;&nbsp;</span>Pandas usual methods</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-15"><span class="toc-item-num">15&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

# Pandas

![pandas](https://media.giphy.com/media/nVsLCrW5iHf6E/giphy.gif)

## Introduction
Pandas is undoubtedly the most widely used library in the Python ecosystem for data manipulation and analysis. It's fast, powerful, flexible, easy to use and open source.


Among its main features:

- A fast and efficient **DataFrame** object for data manipulation with built-in indexing* 

- **Reading and writing** of data in many formats: Microsoft Excel, CSV, SQL databases, etc;

- Integrated and efficient methods for all types of data manipulation: missing data, subset, union, merge, etc;

- Ease of working with temporary data (in fact, Pandas is named after "PANnel DAta")

- Good **integration with other data analysis or Machine learning libraries**: scikit-learn, scipy, seaborn, plotly, etc;

- It is **widely used** in both the private and academic sectors


Pandas provides high-level data structures and functions designed to make working with structured or tabular data fast, easy, and expressive. Since its introduction in 2010, it has helped make Python a powerful and productive data analysis environment. The main pandas objects that will be used in this book are the DataFrame, a column-oriented tabular data structure with row and column labels, and the Series, a labeled one-dimensional array object.

Pandas combines the high performance ideas of NumPy with the flexible data manipulation capabilities of spreadsheets and relational databases (such as SQL). It provides sophisticated indexing functionality to make it easy to reshape, slice and dice, perform aggregations, and select subsets of data.

![image](https://thumbor.forbes.com/thumbor/960x0/https%3A%2F%2Fblogs-images.forbes.com%2Fgilpress%2Ffiles%2F2016%2F03%2FTime-1200x511.jpg)



Source: [Forbes](https://www.forbes.com/sites/gilpress/2016/03/23/data-preparation-most-time-consuming-least-enjoyable-data-science-task-survey-says/#1ba071616f63)

## Installation

The first thing you should do will always be
`pip install pandas`, `conda install pandas`

In [ ]:
# anaconda
    # enviroments: ironhack
    #pandas
    
# miniconda
    # conda activate ironhack
    #pip install pandas

In [66]:
import pandas as pd
import numpy as np

## Introduction to pandas data structures
To get started with pandas, you'll need to get comfortable with its two working data structures: Series and DataFrame. Although they are not a universal solution to all problems, they provide a solid and easy-to-use foundation for most applications.

### Series
A Serie is a one-dimensional array object containing a sequence of values ​​(of NumPy-like types) and an associated array of data labels, called its index. The simplest Series is formed from a single array of data:

In [67]:
my_series = pd.Series([1, 2, 3, "a_string", 12, 5])

In [68]:
my_series

0           1
1           2
2           3
3    a_string
4          12
5           5
dtype: object

In [70]:
random_list = [1, 2, 3, "a_string", 12, 5]

In [71]:
random_list[3]

'a_string'

In [73]:
type(random_list)

list

In [74]:
type(my_series)

pandas.core.series.Series

In [82]:
my_series.values

array([1, 2, 3, 'a_string', 12, 5], dtype=object)

In [78]:
list(my_series.values)

[1, 2, 3, 'a_string', 12, 5]

In [77]:
my_series.index

RangeIndex(start=0, stop=6, step=1)

The string representation of a Series displayed interactively shows the index on the left and the values ​​on the right. Since we didn't specify an index for the data, a default one consisting of the integers 0 to N - 1 (where N is the length of the data) is created. You can get the array representation and the index object of the Series through its values ​​and index attributes, respectively:

Another way to think of a Series is as a fixed-length ordered dict, since it is a mapping of index values ​​to data values. It can be used in many contexts where a dictionary could be used.
If you have data contained in a Python dict, you can create a Series from it by passing the dict:

In [109]:
somedata = {
    "Ohio": 2000,
    "Texas":"2001",
    "Oregon":  79865,
    "Utah":4892383,
    "something else": "4984"
}

In [110]:
somedata

{'Ohio': 2000,
 'Texas': '2001',
 'Oregon': 79865,
 'Utah': 4892383,
 'something else': '4984'}

In [111]:
somedata.values()

dict_values([2000, '2001', 79865, 4892383, '4984'])

In [112]:
somedata.keys()

dict_keys(['Ohio', 'Texas', 'Oregon', 'Utah', 'something else'])

In [113]:
# Q: Capitalization of Series and DataFrame?
# A: needed
#pd.Series
#pd.DataFrame

In [114]:
somedata_series = pd.Series(somedata)
somedata_series

Ohio                 2000
Texas                2001
Oregon              79865
Utah              4892383
something else       4984
dtype: object

In [115]:
somedata_series.index

Index(['Ohio', 'Texas', 'Oregon', 'Utah', 'something else'], dtype='object')

In [116]:
somedata_series.values

array([2000, '2001', 79865, 4892383, '4984'], dtype=object)

In [117]:
states = ["California", "Ohio", "Oregon", "Texas", "something else"]

In [118]:
somedata

{'Ohio': 2000,
 'Texas': '2001',
 'Oregon': 79865,
 'Utah': 4892383,
 'something else': '4984'}

In [119]:
somedata_series = pd.Series(somedata)
somedata_series

Ohio                 2000
Texas                2001
Oregon              79865
Utah              4892383
something else       4984
dtype: object

In [120]:
somedata_series = pd.Series(somedata, index = states)
somedata_series

California          NaN
Ohio               2000
Oregon            79865
Texas              2001
something else     4984
dtype: object

In [121]:
for i in somedata_series.values:
    print(type(i))

<class 'float'>
<class 'int'>
<class 'int'>
<class 'str'>
<class 'str'>

In [106]:
# NaN: missing value
# Not a number
# missing values -> are type float

In [ ]:
# type float cannot do whatever you're trying to applay

When only one dict is passed, the resulting String index will have the keys of the dict in order. You can override this by passing the keys of the dict in the order you want them to appear in the resulting String:

Here, the three values ​​found in sdata were placed in the appropriate places, but since no value was found for 'California', it appears as NaN (not a number), which is considered in pandas to mark missing values ​​or NA. Since "Utah" was not included in the states, it is excluded from the resulting object.

In [ ]:
pd.Series:
    - index
    - values
    
    - array: 1d

In [123]:
somedata_series.index

Index(['California', 'Ohio', 'Oregon', 'Texas', 'something else'], dtype='object')

In [124]:
somedata_series.values

array([nan, 2000, 79865, '2001', '4984'], dtype=object)

### Dataframes
Pandas can read and write data from a wide variety of formats. [Read the documentation](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)
Although one of the most common is from a dict of lists of equal length or NumPy arrays:

#### From data types

`from dictionaries with lists as values`

In [151]:
dictionary_with_lists = {
    "state": ["Ohio", "Texas", "Nevada", "Michigan"],
    "year": [19900, 28374, 3044, 50554],
    "something": [1.6, "THIS IS TEXAS", 3434, np.nan]
}

In [152]:
df = pd.DataFrame(dictionary_with_lists)
df

      state   year      something
0      Ohio  19900            1.6
1     Texas  28374  THIS IS TEXAS
2    Nevada   3044           3434
3  Michigan  50554            NaN

Since we are using Jupyter Notebook, pandas DataFrame objects will be displayed as a more browser-friendly HTML table. [More info on this](https://pandas.pydata.org/pandas-docs/stable/user_guide/options.html)

`from list of dictionaries`

If I create a dataframe through a list of dictionaries:
- Each dictionary will be a row
- The keys will be the names of the columns
- They have to have the same structure

In [159]:
list_of_dictionaries = [
        {"state":"Ohio", "year": 1900, "something": 1.6},
        {"state":"texas", "year": 3434, "something": 2},
        {"state":"nevada", "year": 3434, "something": "hello"},
        {"state":"michigan", "year": 1212, "something": 1.6}
        #{"esteit":"michigan", "year": 1212, "something": 1.6}

]

In [160]:
df = pd.DataFrame(list_of_dictionaries)
df

      state  year something
0      Ohio  1900       1.6
1     texas  3434         2
2    nevada  3434     hello
3  michigan  1212       1.6

[pandas from dict](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.from_dict.html)

#### From path

`.csv`

In [168]:
df = pd.read_csv("../datasets/Advertising.csv")
df

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

In [164]:
#csv: comma separated values

In [ ]:
#csv, separator = ";"

`.xlsx`

In [174]:
df_from_excel = pd.read_excel("../datasets/Online Retail.xlsx", engine="openpyxl")
df_from_excel.head() # Supports `xls`, `xlsx`, `xlsm`, `xlsb`, `odf`, `ods` and `odt` file extensions

,InvoiceNo,InvoiceNo.1,InvoiceNo.2,InvoiceNo.3,InvoiceNo.4,InvoiceNo.5,InvoiceNo.6,InvoiceNo.7,InvoiceNo.8
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom

`Reading different sheeets`

In [ ]:
# Default tab (first one)

#df_from_excel_new_tab = pd.read_excel("../datasets/Online Retail.xlsx", engine="openpyxl")3#
#df_from_excel_new_tab.head()

In [ ]:
# Other tab: new_tab
#df_from_excel_new_tab = pd.read_excel("../datasets/Online Retail.xlsx", engine="openpyxl", "new_tab")3#
#df_from_excel_new_tab.head()

`web`: https://raw.githubusercontent.com/datapackage-examples/sample-csv/master/sample.csv

In [177]:
df = pd.read_csv("https://raw.githubusercontent.com/datapackage-examples/sample-csv/master/sample.csv")
df

,header 0,header 1,header 2,header 3,header 4,header 5,header 6,header 7,header 8,header 9
0,row 1 col 0,row 1 col 1,row 1 col 2,row 1 col 3,row 1 col 4,row 1 col 5,row 1 col 6,row 1 col 7,row 1 col 8,row 1 col 9
1,row 2 col 0,row 2 col 1,row 2 col 2,row 2 col 3,row 2 col 4,row 2 col 5,row 2 col 6,row 2 col 7,row 2 col 8,row 2 col 9
2,row 3 col 0,row 3 col 1,row 3 col 2,row 3 col 3,row 3 col 4,row 3 col 5,row 3 col 6,row 3 col 7,row 3 col 8,row 3 col 9
3,row 4 col 0,row 4 col 1,row 4 col 2,row 4 col 3,row 4 col 4,row 4 col 5,row 4 col 6,row 4 col 7,row 4 col 8,row 4 col 9
4,row 5 col 0,row 5 col 1,row 5 col 2,row 5 col 3,row 5 col 4,row 5 col 5,row 5 col 6,row 5 col 7,row 5 col 8,row 5 col 9
5,row 6 col 0,row 6 col 1,row 6 col 2,row 6 col 3,row 6 col 4,row 6 col 5,row 6 col 6,row 6 col 7,row 6 col 8,row 6 col 9
6,row 7 col 0,row 7 col 1,row 7 col 2,row 7 col 3,row 7 col 4,row 7 col 5,row 7 col 6,row 7 col 7,row 7 col 8,row 7 col 9
7,row 8 col 0,row 8 col 1,row 8 col 2,row 8 col 3,row 8 col 4,row 8 col 5,row 8 col 6,row 8 col 7,row 8 col 8,row 8 col 9
8,row 9 col 0,row 9 col 1,row 9 col 2,row 9 col 3,row 9 col 4,row 9 col 5,row 9 col 6,row 9 col 7,row 9 col 8,row 9 col 9
9,row 10 col 0,row 10 col 1,row 10 col 2,row 10 col 3,row 10 col 4,row 10 col 5,row 10 col 6,row 10 col 7,row 10 col 8,row 10 col 9

#### From databases

`sql`: [docs](https://pandas.pydata.org/docs/reference/api/pandas.read_sql.html)

```python
from sqlite3 import connect

conn = connect(':memory:')
df = pd.read_sql('SELECT column_1, column_2 FROM sample_data', conn)

df.to_sql('test_data', conn)
```

`mongodb`

```python
import pymongo
from pymongo import MongoClient

client = MongoClient()
db = client.database_name
collection = db.collection_name
data = pd.DataFrame(list(collection.find()))
```

## Exploratory analysis of a dataframe

In [6]:
df = pd.read_csv("../datasets/Advertising.csv")
df

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

### Meta information

`shape, columns, dtypes, info, describe`

In [ ]:
"""
class DataFrame ():
    def __init__ (self, data):
        self.shape = shape
        self.columns = []
"""

In [8]:
df.shape

(200, 4)

In [9]:
df.columns

Index(['TV', 'Radio', 'Newspaper', 'Sales'], dtype='object')

In [10]:
list(df.columns)

['TV', 'Radio', 'Newspaper', 'Sales']

In [11]:
df.dtypes

TV           float64
Radio        float64
Newspaper    float64
Sales        float64
dtype: object

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   Radio      200 non-null    float64
 2   Newspaper  200 non-null    float64
 3   Sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

In [15]:
df.describe() # Generate descriptive statistics

               TV       Radio   Newspaper       Sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   14.022500
std     85.854236   14.846809   21.778621    5.217457
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   10.375000
50%    149.750000   22.900000   25.750000   12.900000
75%    218.825000   36.525000   45.100000   17.400000
max    296.400000   49.600000  114.000000   27.000000

[dtypes](https://numpy.org/doc/stable/reference/arrays.dtypes.html)

### Previsualization

`head`

In [ ]:
# bash: head & tail

In [16]:
df.head()

      TV  Radio  Newspaper  Sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9

By default head shows me the first 5 rows, I can see some more or less by passing a number as a parameter

In [17]:
df.head(8)

      TV  Radio  Newspaper  Sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9
5    8.7   48.9       75.0    7.2
6   57.5   32.8       23.5   11.8
7  120.2   19.6       11.6   13.2

`tail`

In [18]:
df.tail()

        TV  Radio  Newspaper  Sales
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

`sample`

In [29]:
df.sample()

       TV  Radio  Newspaper  Sales
53  182.6   46.2       58.7   21.2

In [46]:
df.sample(frac=0.01) # %

        TV  Radio  Newspaper  Sales
170   50.0   11.6       18.4    8.4
98   289.7   42.3       51.2   25.4

In [48]:
df.sample(5)

        TV  Radio  Newspaper  Sales
116  139.2   14.3       25.6   12.2
61   261.3   42.7       54.7   24.2
170   50.0   11.6       18.4    8.4
43   206.9    8.4       26.4   12.9
104  238.2   34.3        5.3   20.7

In [49]:
df.sample(n=5)

        TV  Radio  Newspaper  Sales
51   100.4    9.6        3.6   10.7
113  209.6   20.6       10.7   15.9
162  188.4   18.1       25.6   14.9
181  218.5    5.4       27.4   12.2
22    13.2   15.9       49.6    5.6

`display`

In [50]:
display(df)

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

### NaN values
NaN stands for Not A Number and is one of the common ways to represent the missing value in the data. It is a special floating point value and cannot be converted to a type other than float.
The NaN value is one of the main problems in data analysis. It is very essential to deal with NaN to get the desired results.

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   Radio      200 non-null    float64
 2   Newspaper  200 non-null    float64
 3   Sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

In [54]:
pd.isnull(df).sum() # If Null -> it's True -> sum() a True, the result will be 1

TV           0
Radio        0
Newspaper    0
Sales        0
dtype: int64

In [55]:
pd.isna(df).sum() #same method

TV           0
Radio        0
Newspaper    0
Sales        0
dtype: int64

###  Basic descriptive statistics

In [56]:
df.sample()

        TV  Radio  Newspaper  Sales
186  139.5    2.1       26.6   10.3

In [62]:
df.Sales.value_counts() #dot notation: capital letter

9.7     5
12.9    4
11.7    4
15.9    4
25.4    3
       ..
15.7    1
14.2    1
11.2    1
19.4    1
18.5    1
Name: Sales, Length: 121, dtype: int64

In [63]:
df["Sales"].value_counts() #

9.7     5
12.9    4
11.7    4
15.9    4
25.4    3
       ..
15.7    1
14.2    1
11.2    1
19.4    1
18.5    1
Name: Sales, Length: 121, dtype: int64

In [66]:
dict_ = {
    "age": 30
}

In [70]:
#dict_["Sales"] #key error

In [65]:
#df["Sales "] #key error

In [72]:
df.Sales

0      22.1
1      10.4
2       9.3
3      18.5
4      12.9
       ...
195     7.6
196     9.7
197    12.8
198    25.5
199    13.4
Name: Sales, Length: 200, dtype: float64

In [79]:
df["Sales"].min()

1.6

In [75]:
df["Sales"].max()

27.0

In [76]:
df["Sales"].std()

5.217456565710477

In [78]:
df.Sales.mean()

14.022500000000003

In [ ]:
#np.array.max()
#pd.Series.max()

## Basic operations with dataframes

### Select: column

In [80]:
df.Sales

0      22.1
1      10.4
2       9.3
3      18.5
4      12.9
       ...
195     7.6
196     9.7
197    12.8
198    25.5
199    13.4
Name: Sales, Length: 200, dtype: float64

In [81]:
df["Sales"]

0      22.1
1      10.4
2       9.3
3      18.5
4      12.9
       ...
195     7.6
196     9.7
197    12.8
198    25.5
199    13.4
Name: Sales, Length: 200, dtype: float64

### Select: subset

In [82]:
df.sample()

        TV  Radio  Newspaper  Sales
185  205.0   45.1       19.6   22.6

In [ ]:
# TV, Radio
    # Inputting a list keys
    # Call the columns: df["Sales"]

In [87]:
df["TV"] #Series: just the series

0      230.1
1       44.5
2       17.2
3      151.5
4      180.8
       ...
195     38.2
196     94.2
197    177.0
198    283.6
199    232.1
Name: TV, Length: 200, dtype: float64

In [90]:
list(df.columns)

['TV', 'Radio', 'Newspaper', 'Sales']

In [96]:
new_list_columns = list(df.columns)[:-1]

In [98]:
target_columns = {
    "TV": "dfhjdsjzhv<fAHJWfs",
    "Radio": 3434
}

In [100]:
df[target_columns] #you can pass a dictionary as an argument

        TV  Radio
0    230.1   37.8
1     44.5   39.3
2     17.2   45.9
3    151.5   41.3
4    180.8   10.8
..     ...    ...
195   38.2    3.7
196   94.2    4.9
197  177.0    9.3
198  283.6   42.0
199  232.1    8.6

[200 rows x 2 columns]

In [101]:
df[["TV", "Radio", "Newspaper"]] #DF: result of passing a list

        TV  Radio  Newspaper
0    230.1   37.8       69.2
1     44.5   39.3       45.1
2     17.2   45.9       69.3
3    151.5   41.3       58.5
4    180.8   10.8       58.4
..     ...    ...        ...
195   38.2    3.7       13.8
196   94.2    4.9        8.1
197  177.0    9.3        6.4
198  283.6   42.0       66.2
199  232.1    8.6        8.7

[200 rows x 3 columns]

In [83]:
df.columns

Index(['TV', 'Radio', 'Newspaper', 'Sales'], dtype='object')

### Get the unique values ​​of a column

In [103]:
df = pd.read_csv("../datasets/avocado_kaggle.csv")
df.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [105]:
df.region

0                  Albany
1                  Albany
2                  Albany
3                  Albany
4                  Albany
               ...
18244    WestTexNewMexico
18245    WestTexNewMexico
18246    WestTexNewMexico
18247    WestTexNewMexico
18248    WestTexNewMexico
Name: region, Length: 18249, dtype: object

In [104]:
df["region"]

0                  Albany
1                  Albany
2                  Albany
3                  Albany
4                  Albany
               ...
18244    WestTexNewMexico
18245    WestTexNewMexico
18246    WestTexNewMexico
18247    WestTexNewMexico
18248    WestTexNewMexico
Name: region, Length: 18249, dtype: object

`df.column.unique()`

In [111]:
df.type.unique()

array(['conventional', 'organic'], dtype=object)

`df.column.value_counts()`

In [110]:
df["type"].value_counts()

conventional    9126
organic         9123
Name: type, dtype: int64

### Filter based on condition

In [ ]:
# Filter based on a condition

df
df -> type column

ONLY the values that correspond to type "organic"

In [ ]:
#df["type"].unique("organic")

In [ ]:
#df["type"]["organic"]

In [112]:
#df["type"] == "organic"

0        conventional
1        conventional
2        conventional
3        conventional
4        conventional
             ...
18244         organic
18245         organic
18246         organic
18247         organic
18248         organic
Name: type, Length: 18249, dtype: object

In [115]:
condition_1 = df["type"] == "organic"

In [118]:
df[condition_1].head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
9126,0,2015-12-27,1.83,989.55,8.16,88.59,0.0,892.80,892.80,0.00,0.0,organic,2015,Albany
9127,1,2015-12-20,1.89,1163.03,30.24,172.14,0.0,960.65,960.65,0.00,0.0,organic,2015,Albany
9128,2,2015-12-13,1.85,995.96,10.44,178.70,0.0,806.82,806.82,0.00,0.0,organic,2015,Albany
9129,3,2015-12-06,1.84,1158.42,90.29,104.18,0.0,963.95,948.52,15.43,0.0,organic,2015,Albany
9130,4,2015-11-29,1.94,831.69,0.00,94.73,0.0,736.96,736.96,0.00,0.0,organic,2015,Albany

In [120]:
df_organic = df[df["type"] == "organic"]
df_organic.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
9126,0,2015-12-27,1.83,989.55,8.16,88.59,0.0,892.80,892.80,0.00,0.0,organic,2015,Albany
9127,1,2015-12-20,1.89,1163.03,30.24,172.14,0.0,960.65,960.65,0.00,0.0,organic,2015,Albany
9128,2,2015-12-13,1.85,995.96,10.44,178.70,0.0,806.82,806.82,0.00,0.0,organic,2015,Albany
9129,3,2015-12-06,1.84,1158.42,90.29,104.18,0.0,963.95,948.52,15.43,0.0,organic,2015,Albany
9130,4,2015-11-29,1.94,831.69,0.00,94.73,0.0,736.96,736.96,0.00,0.0,organic,2015,Albany

### Change the data type of a column

In [223]:
# df.dtypes

Unnamed: 0        int64
Date             object
AveragePrice    float64
Total Volume    float64
4046            float64
4225            float64
4770            float64
Total Bags      float64
Small Bags      float64
Large Bags      float64
XLarge Bags     float64
type             object
year              int64
region           object
dtype: object

In [224]:
df["AveragePrice"] = df["AveragePrice"].astype("int")
df["AveragePrice"] 

# another approach: define a functipon and apply it to a column

0        1
1        1
2        0
3        1
4        1
        ..
18244    1
18245    1
18246    1
18247    1
18248    1
Name: AveragePrice, Length: 18249, dtype: int64

In [225]:
df.dtypes #object = string

Unnamed: 0        int64
Date             object
AveragePrice      int64
Total Volume    float64
4046            float64
4225            float64
4770            float64
Total Bags      float64
Small Bags      float64
Large Bags      float64
XLarge Bags     float64
type             object
year              int64
region           object
dtype: object

### We filter the data by the value of the columns

In [121]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
10986,40,2015-03-22,1.8,34244.34,3811.27,19130.46,22.89,11279.72,10549.2,730.52,0.0,organic,2015,Plains

In [ ]:
# type: organic
# AveragePrice < 1

In [122]:
condition_organic = df["type"] == "organic" #serie of booleans
condition_avg_price = df["AveragePrice"] < 1 #serie of booleans

In [129]:
df[condition_organic].sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
11738,12,2015-10-04,1.47,1402.83,15.38,0.0,0.0,1387.45,1387.45,0.0,0.0,organic,2015,Tampa

In [139]:
df[condition_organic & condition_avg_price].sample() #and

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
15473,43,2017-03-05,0.48,50890.73,717.57,4138.84,0.0,46034.32,1385.06,44649.26,0.0,organic,2017,Detroit

In [140]:
df[condition_organic | condition_avg_price].sample() #or

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
12250,5,2016-11-20,2.1,107587.14,18289.69,44678.81,12.3,44606.34,39260.51,5345.83,0.0,organic,2016,California

In [ ]:
# condition 1
    #type: organic
    
    # cndition 2
        #price < 1
    # condition 3
        # price > 1.8
    
    
condition_1 AND (condition_2 OR condition 3)
avg price -> 0-1, 1.8 >

In [176]:
condition_1 = (df["type"] == "organic")
condition_2 = (df.AveragePrice < 1)
condition_3 = (df.AveragePrice > 1.8)

`watch out for | symbol`

In [183]:
new_filtered = df[condition_1 & (condition_2 | condition_3)]
new_filtered.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
9126,0,2015-12-27,1.83,989.55,8.16,88.59,0.0,892.80,892.80,0.00,0.0,organic,2015,Albany
9127,1,2015-12-20,1.89,1163.03,30.24,172.14,0.0,960.65,960.65,0.00,0.0,organic,2015,Albany
9128,2,2015-12-13,1.85,995.96,10.44,178.70,0.0,806.82,806.82,0.00,0.0,organic,2015,Albany
9129,3,2015-12-06,1.84,1158.42,90.29,104.18,0.0,963.95,948.52,15.43,0.0,organic,2015,Albany
9130,4,2015-11-29,1.94,831.69,0.00,94.73,0.0,736.96,736.96,0.00,0.0,organic,2015,Albany

In [227]:
df["AveragePrice"].max()

3

In [184]:
new_filtered["type"].value_counts()

organic    3117
Name: type, dtype: int64

In [186]:
df.AveragePrice.mean()

1.4059784097758825

In [185]:
new_filtered["AveragePrice"].mean()

1.9670356111645804

In [187]:
df.shape

(18249, 14)

In [188]:
new_filtered.shape

(3117, 14)

In [179]:
df[df["type"] == "organic" & ((df.AveragePrice < 1) |  (df.AveragePrice > 1.8))]

In [ ]:
# 1. Condition: Detroit
# 2. AveragePrice < 1
# 3: year: I dont like 
    # either before 2016
    # after 2017
# 4. type: conventional

In [203]:
condition_1 = df["region"] == "Detroit"
condition_2 = df["AveragePrice"] < 1
condition_3 = df.year < 2016
condition_4 = df.year > 2017
condition_5 = df.type == "conventional"

In [209]:
df_filtered = df[condition_1 & condition_2 & (condition_3 | condition_4) &  condition_5]
df_filtered.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
679,3,2015-12-06,0.98,339797.19,92957.56,78805.63,113791.21,54242.79,30612.06,885.86,22744.87,conventional,2015,Detroit

In [192]:
df.columns

Index(['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type',
       'year', 'region'],
      dtype='object')

In [190]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
1869,49,2015-01-18,1.02,1674945.55,966515.75,485150.34,14504.7,208774.76,206579.02,1074.3,1121.44,conventional,2015,Plains

In [212]:
df.describe()

,Unnamed: 0,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,year
count,18249.000000,18249.000000,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,18249.000000,18249.000000
mean,24.232232,1.405978,8.506440e+05,2.930084e+05,2.951546e+05,2.283974e+04,2.396392e+05,1.821947e+05,5.433809e+04,3106.426507,2016.147899
std,15.481045,0.402677,3.453545e+06,1.264989e+06,1.204120e+06,1.074641e+05,9.862424e+05,7.461785e+05,2.439660e+05,17692.894652,0.939938
min,0.000000,0.440000,8.456000e+01,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000,2015.000000
25%,10.000000,1.100000,1.083858e+04,8.540700e+02,3.008780e+03,0.000000e+00,5.088640e+03,2.849420e+03,1.274700e+02,0.000000,2015.000000
50%,24.000000,1.370000,1.073768e+05,8.645300e+03,2.906102e+04,1.849900e+02,3.974383e+04,2.636282e+04,2.647710e+03,0.000000,2016.000000
75%,38.000000,1.660000,4.329623e+05,1.110202e+05,1.502069e+05,6.243420e+03,1.107834e+05,8.333767e+04,2.202925e+04,132.500000,2017.000000
max,52.000000,3.250000,6.250565e+07,2.274362e+07,2.047057e+07,2.546439e+06,1.937313e+07,1.338459e+07,5.719097e+06,551693.650000,2018.000000

### Copy a dataframe and rename columns

In [215]:
a_new_copy = df.copy()
a_new_copy.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
1397,45,2015-02-15,1.03,153852.03,109047.7,9817.42,11085.73,23901.18,21186.15,2715.03,0.0,conventional,2015,Nashville

#### Rename columns

`.rename(dict_)`

In [263]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region,quantity,quantity_2
12388,39,2016-03-27,1,35086.33,171.4,34565.26,0.0,349.67,349.67,0.0,0.0,organic,2016,Chicago,35086330.0,3508 €

In [266]:
print(list(df.columns))

['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225', '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type', 'year', 'region', 'quantity', 'quantity_2']

The rename method allows me to rename only the columns that I want, the ones that are in the dictionary. No need to rename all at once

In [272]:
df.rename(columns={"Total Volume": "total_volume"}, inplace=True)

In [279]:
columns_dict = {i: i.lower().replace(" ", "").replace(":", "") for i in list(df.columns)}
columns_dict

{'unnamed_0': 'unnamed_0',
 'date': 'date',
 'averageprice': 'averageprice',
 'total_volume': 'total_volume',
 '4046': '4046',
 '4225': '4225',
 '4770': '4770',
 'total_bags': 'total_bags',
 'small_bags': 'small_bags',
 'large_bags': 'large_bags',
 'xlarge_bags': 'xlarge_bags',
 'type': 'type',
 'year': 'year',
 'region': 'region',
 'quantity': 'quantity',
 'quantity_2': 'quantity_2'}

In [289]:
df.rename(columns = columns_dict).tail()

,unnamed_0,date,averageprice,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region,quantity,quantity_2
18244,7,2018-02-04,1,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico,17074830.0,1707 €
18245,8,2018-01-28,1,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico,13888040.0,1388 €
18246,9,2018-01-21,1,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico,13766760.0,1376 €
18247,10,2018-01-14,1,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico,16205220.0,1620 €
18248,11,2018-01-07,1,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico,17489580.0,1748 €

In [290]:
df.sample()

,unnamed_0,date,averageprice,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region,quantity,quantity_2
13554,9,2016-10-23,1,4025.09,740.65,53.73,0.0,3230.71,10.0,3220.71,0.0,organic,2016,Orlando,4025090.0,4025 €

In [ ]:
#df.rename(columns={"A": "a", "B": "b", "C": "c"}, errors="raise")

`overwriting attributes`: Requires a list with the same number of columns

In [275]:
list(df.columns)

['Unnamed: 0',
 'Date',
 'AveragePrice',
 'total_volume',
 '4046',
 '4225',
 '4770',
 'Total Bags',
 'Small Bags',
 'Large Bags',
 'XLarge Bags',
 'type',
 'year',
 'region',
 'quantity',
 'quantity_2']

In [277]:
df.columns = [i.lower().replace(" ", "_").replace(":", "") for i in list(df.columns)]
df.columns

Index(['unnamed_0', 'date', 'averageprice', 'total_volume', '4046', '4225',
       '4770', 'total_bags', 'small_bags', 'large_bags', 'xlarge_bags', 'type',
       'year', 'region', 'quantity', 'quantity_2'],
      dtype='object')

In [285]:
df.sample()

,unnamed_0,date,averageprice,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region,quantity,quantity_2
11685,11,2015-10-11,1,1599.13,0.0,26.54,0.0,1572.59,1572.59,0.0,0.0,organic,2015,Syracuse,1599130.0,1599 €

### delete columns

In [300]:
df.sample()

,date,averageprice,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region,quantity,quantity_2
15729,2017-05-07,1,36724.25,10306.19,14.17,0.0,26403.89,25913.73,490.16,0.0,organic,2017,Houston,36724250.0,3672 €

In [299]:
# unnamed_0
# Unnamed: 0
#df.drop(columns=["unnamed_0"], inplace=True)

In [301]:
df.sample()

,date,averageprice,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region,quantity,quantity_2
4533,2016-10-23,1,699711.07,250712.73,188686.25,16864.42,243447.67,127647.02,115800.65,0.0,conventional,2016,PhoenixTucson,699711070.0,6997 €

In [305]:
df.sample()

,date,averageprice,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region,quantity,quantity_2
13200,2016-08-14,1,6720.9,4.99,42.58,0.0,6673.33,6613.33,60.0,0.0,organic,2016,MiamiFtLauderdale,6720900.0,6720 €

In [308]:
df.drop(columns = ["quantity"], inplace=False, axis=1)

,date,averageprice,total_volume,4046,4225,4770,total_bags,small_bags,large_bags,xlarge_bags,type,year,region,quantity_2
0,2015-12-27,1,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany,6423 €
1,2015-12-20,1,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany,5487 €
2,2015-12-13,0,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany,0.0 €
3,2015-12-06,1,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany,7899 €
4,2015-11-29,1,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany,5103 €
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,2018-02-04,1,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico,1707 €
18245,2018-01-28,1,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico,1388 €
18246,2018-01-21,1,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico,1376 €
18247,2018-01-14,1,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico,1620 €
18248,2018-01-07,1,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico,1748 €

In [315]:
import pandas as pd

#create DataFrame
df = pd.DataFrame({'team': ['A', 'A', 'A', 'A', 'B', 'B', 'B', 'B'],
                   'assists': [5, 7, 7, 9, 12, 9, 9, 4],
                   'points': [11, 8, 10, 6, 6, 5, 9, 12]})
df

  team  assists  points
0    A        5      11
1    A        7       8
2    A        7      10
3    A        9       6
4    B       12       6
5    B        9       5
6    B        9       9
7    B        4      12

In [319]:
#df.drop(['points', "team"], axis=1, inplace=True) #KeyError: "['points' 'team'] not found in axis"

In [311]:
df_new = df.drop('points', axis= 1) # KeyError: "['points'] not found in axis"

In [312]:
df_new

  team  assists
0    A        5
1    A        7
2    A        7
3    A        9
4    B       12
5    B        9
6    B        9
7    B        4

### delete rows

In [324]:
df = pd.read_csv("../datasets/avocado_kaggle.csv")
df.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [327]:
df.drop([0, 1, 2, 3, 4, 5, 6, 7, 8], axis=0, inplace=False)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
9,9,2015-10-25,1.07,74338.76,842.40,64757.44,113.00,8625.92,8061.47,564.45,0.0,conventional,2015,Albany
10,10,2015-10-18,1.12,84843.44,924.86,75595.85,117.07,8205.66,7877.86,327.80,0.0,conventional,2015,Albany
11,11,2015-10-11,1.28,64489.17,1582.03,52677.92,105.32,10123.90,9866.27,257.63,0.0,conventional,2015,Albany
12,12,2015-10-04,1.31,61007.10,2268.32,49880.67,101.36,8756.75,8379.98,376.77,0.0,conventional,2015,Albany
13,13,2015-09-27,0.99,106803.39,1204.88,99409.21,154.84,6034.46,5888.87,145.59,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

Rows can also be deleted. Note that the indexes are not reset. The index is associated with the row, not the order.
Can the index be restarted? Correct

### setting the index

We read the [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reset_index.html) to understand some parameters

`set_index`

In [343]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
17767,7,2018-02-04,1.21,8320.22,15.77,626.63,0.0,7677.82,7677.82,0.0,0.0,organic,2018,GrandRapids

In [344]:
df.set_index("year", inplace=False)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,region
year,,,,,,,,,,,,,
2015,9,2015-10-25,1.07,74338.76,842.40,64757.44,113.00,8625.92,8061.47,564.45,0.0,conventional,Albany
2015,10,2015-10-18,1.12,84843.44,924.86,75595.85,117.07,8205.66,7877.86,327.80,0.0,conventional,Albany
2015,11,2015-10-11,1.28,64489.17,1582.03,52677.92,105.32,10123.90,9866.27,257.63,0.0,conventional,Albany
2015,12,2015-10-04,1.31,61007.10,2268.32,49880.67,101.36,8756.75,8379.98,376.77,0.0,conventional,Albany
2015,13,2015-09-27,0.99,106803.39,1204.88,99409.21,154.84,6034.46,5888.87,145.59,0.0,conventional,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2018,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,WestTexNewMexico
2018,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,WestTexNewMexico
2018,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,WestTexNewMexico
2018,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,WestTexNewMexico
2018,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,WestTexNewMexico

`reset_index`

In [328]:
df.drop([0, 1, 2, 3, 4, 5, 6, 7, 8], axis=0, inplace=True)

In [330]:
df.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
9,9,2015-10-25,1.07,74338.76,842.40,64757.44,113.00,8625.92,8061.47,564.45,0.0,conventional,2015,Albany
10,10,2015-10-18,1.12,84843.44,924.86,75595.85,117.07,8205.66,7877.86,327.80,0.0,conventional,2015,Albany
11,11,2015-10-11,1.28,64489.17,1582.03,52677.92,105.32,10123.90,9866.27,257.63,0.0,conventional,2015,Albany
12,12,2015-10-04,1.31,61007.10,2268.32,49880.67,101.36,8756.75,8379.98,376.77,0.0,conventional,2015,Albany
13,13,2015-09-27,0.99,106803.39,1204.88,99409.21,154.84,6034.46,5888.87,145.59,0.0,conventional,2015,Albany

In [332]:
df["AveragePrice"][9]

1.07

In [335]:
df.columns

Index(['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type',
       'year', 'region'],
      dtype='object')

In [341]:
df.reset_index(drop=True, inplace=True)

In [342]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
16033,29,2017-06-11,1.89,6104.29,837.58,250.77,0.0,5015.94,5015.94,0.0,0.0,organic,2017,MiamiFtLauderdale

What can we use to have the date as an index?
We will see it later, to analyze temporary series

In [ ]:
# index: unique
# an order
# maybe  before passing it to new libraries

### Operations between columns

In [233]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
12848,31,2016-05-22,2,10501.75,29.41,3535.03,0.0,6937.31,6925.43,11.88,0.0,organic,2016,HartfordSpringfield

In [234]:
df["quantity"] = df["AveragePrice"] * df["Total Volume"]

In [246]:
df["quantity"] = df["quantity"] * 10

In [261]:
df["quantity_2"] = df["quantity"].apply(lambda x: str(x/10)[:4] + " €")

In [260]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region,quantity,quantity_2
14021,8,2016-10-30,2,5676.57,1550.22,3615.86,0.0,510.49,510.49,0.0,0.0,organic,2016,Sacramento,11353140.0,1135314.0 €

In [237]:
dict_ = {
    "age": 40
}

In [240]:
dict_["name"] = "Alberto"

In [241]:
dict_

{'age': 40, 'name': 'Alberto'}

In [247]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region,quantity
16009,49,2017-01-22,1,2097.61,0.0,1006.17,0.0,1091.44,536.66,554.78,0.0,organic,2017,Louisville,2097610.0

In [345]:
df.shape

(18240, 14)

In [346]:
len(df.index)

18240

In [347]:
df.index

RangeIndex(start=0, stop=18240, step=1)

In [348]:
df.year

0        2015
1        2015
2        2015
3        2015
4        2015
         ...
18235    2018
18236    2018
18237    2018
18238    2018
18239    2018
Name: year, Length: 18240, dtype: int64

In [350]:
df.set_index("year", inplace=True)

In [351]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,region
year,,,,,,,,,,,,,
2015,37,2015-04-12,1.23,6492.79,344.8,3395.88,524.9,2227.21,915.26,1311.95,0.0,organic,RichmondNorfolk

In [352]:
df.index

Int64Index([2015, 2015, 2015, 2015, 2015, 2015, 2015, 2015, 2015, 2015,
            ...
            2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018],
           dtype='int64', name='year', length=18240)

In [353]:
len(df.index)

18240

In [361]:
df["year_2"] = df.index

In [365]:
df.drop(columns = "year", axis = 1, inplace=True)

In [366]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,region,year_2
year,,,,,,,,,,,,,,
2015,19,2015-08-16,0.66,1203149.94,836443.14,223690.17,8294.96,134721.67,95992.23,38729.44,0.0,conventional,PhoenixTucson,2015

In [369]:
df.reset_index(drop=True, inplace=True)

In [370]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,region,year_2
17500,12,2017-10-08,2.37,153186.84,25306.59,26921.31,62.43,100896.51,65388.81,35461.95,45.75,organic,West,2017

'Unnamed: 0'

In [377]:
df.drop(df.columns[0], inplace=True, axis=1)

In [371]:
len(df.index) == len(set(df.index))

True

In [378]:
df.sample()

,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,region,year_2
5546,2016-02-28,0.78,7193896.75,2394790.48,1865704.89,251937.95,2681463.43,1557228.28,1123472.59,762.56,conventional,West,2016

In [379]:
df["new"] = df["Total Volume"] + df["4046"]

In [380]:
df.sample()

,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,region,year_2,new
4989,2016-11-13,1.94,506543.8,118820.99,308678.33,3208.3,75836.18,74569.34,976.56,290.28,conventional,SanFrancisco,2016,625364.79

## Apply !

`apply to a pd.Series`

Applies a function along an axis of the DataFrame.
[Read the docs](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html)

When I do an apply on a column, even though I use a lambda, I don't put axis because in the case below, what I'm doing is modifying a column, I use lambda to tell the apply that the first argument is a string that comes from outside and the second argument is the dataframe's own record.

The same way map receives a function and something it iteraves over
A DF is composed of numpy.arrays. So it's an iterable


#### Passing a map or an apply
- map -> function, iterable
- apply -> function, iterable


#### Receive:

- apply & user-defined function -> apply(function) "x", a value
- apply & lambda -> lambda row: row["column"]

`apply to a df`

## Df .loc & .iloc

### Select rows and columns in Pandas by position with iloc

loc syntax with multiple conditions
```python
df.loc[(df["column"] condition) & (df["column"] condition)]
````

The iloc method is used on DataFrames to select elements based on their location. Its syntax is data.iloc[<filas>, <columnas>], where <filas> and <columnas> are the position of the rows and columns that you want to select in the order that they appear in the object. A familiar notation for Matlab users. In a DataFrame, each of the rows has a number that goes from 0 to the total number of rows minus one. Being iloc the method that allows selecting the data based on these numbers. The same applies to columns.

In iloc there are two arguments rows and columns. In case the second is omitted, all columns in the row will be selected. So to select different rows can be used.

### Select rows and columns in Pandas based on labels with loc
The loc method can be used in two different ways: select rows or columns based on a label, or select rows or columns based on a condition.

#### Based on label

## Order a dataframe

In [386]:
df.sort_values(by=["year_2", "type"], ascending=False) # with two args

,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,region,year_2,new
17592,2018-03-25,1.71,2321.82,42.95,272.41,0.00,2006.46,1996.46,10.00,0.0,organic,Albany,2018,2364.77
17593,2018-03-18,1.66,3154.45,275.89,297.96,0.00,2580.60,2577.27,3.33,0.0,organic,Albany,2018,3430.34
17594,2018-03-11,1.68,2570.52,131.67,229.56,0.00,2209.29,2209.29,0.00,0.0,organic,Albany,2018,2702.19
17595,2018-03-04,1.48,3851.30,311.55,296.77,0.00,3242.98,3239.65,3.33,0.0,organic,Albany,2018,4162.85
17596,2018-02-25,1.56,5356.63,816.56,532.59,0.00,4007.48,4007.48,0.00,0.0,organic,Albany,2018,6173.19
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2794,2015-02-01,0.71,916367.42,611270.39,205181.23,14107.36,85808.44,82065.70,3742.74,0.0,conventional,WestTexNewMexico,2015,1527637.81
2795,2015-01-25,0.80,720800.61,519142.82,124248.86,10573.29,66835.64,65072.69,1762.95,0.0,conventional,WestTexNewMexico,2015,1239943.43
2796,2015-01-18,0.80,729795.72,516446.41,128438.87,12473.14,72437.30,71564.22,873.08,0.0,conventional,WestTexNewMexico,2015,1246242.13
2797,2015-01-11,0.92,584896.99,347125.63,129717.42,27944.07,80109.87,78503.46,1606.41,0.0,conventional,WestTexNewMexico,2015,932022.62
2798,2015-01-04,0.75,758118.95,426878.87,147958.43,15267.89,168013.76,165202.22,2811.54,0.0,conventional,WestTexNewMexico,2015,1184997.82

Same operation, but give me only concrete columns

In [389]:
df.sort_values(by=["year_2", "type"], ascending=False)[["year_2", "region"]]
#df[["year_2", "region"]]

       year_2            region
17592    2018            Albany
17593    2018            Albany
17594    2018            Albany
17595    2018            Albany
17596    2018            Albany
...       ...               ...
2794     2015  WestTexNewMexico
2795     2015  WestTexNewMexico
2796     2015  WestTexNewMexico
2797     2015  WestTexNewMexico
2798     2015  WestTexNewMexico

[18240 rows x 2 columns]

## Null values

In [394]:
import seaborn as sns
df_titanic = sns.load_dataset("titanic")
df_titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [396]:
df_titanic.info();

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [397]:
df_titanic.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

#### It is null?

`pd.isna()` == `pd.isnull()`

In [390]:
df_titanic.isna().sum()

Date            0
AveragePrice    0
Total Volume    0
4046            0
4225            0
4770            0
Total Bags      0
Small Bags      0
Large Bags      0
XLarge Bags     0
type            0
region          0
year_2          0
new             0
dtype: int64

In [392]:
df_titanic.isnull(df).sum()

Date            0
AveragePrice    0
Total Volume    0
4046            0
4225            0
4770            0
Total Bags      0
Small Bags      0
Large Bags      0
XLarge Bags     0
type            0
region          0
year_2          0
new             0
dtype: int64

#### Is NOT null?

#### Sum the null values ​​of each column

### delete null values
There are several ways to do this, we take into account the "how" parameter and of course [the docs](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html).

In [399]:
df_titanic.shape

(891, 15)

In [398]:
df_titanic.dropna(how="any", inplace=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [400]:
df_titanic.dropna(how="all", inplace=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
# Can I drop the row inst

REMEMBER THAT INPLACE TRUE IS FOR THE METHOD TO ACTION ON THE DF, IF NOT, I HAVE TO SAVE IT IN A NEW VARIABLE

With "any" (parameter that comes by default so be careful not to put anything) all the records in which there is a NaN in any column are deleted

In [ ]:
# Nans: how many

    # how: any, all
    # thresh: exclusive with how
    
#https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.dropna.html?highlight=dropna#pandas.DataFrame.dropna

`Dropping missing values where all are missing values`

`Dropping missing values where there's ANY`

### How to fill in the missing data

How about a little [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.fillna.html)?

###### CATEGORIES IN DATAFRAME: DOCUMENTATION
https://runebook.dev/en/docs/pandas/user_guide/categorical

## We delete the duplicates

[Read the docs](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.duplicated.html)

## Data aggregation

`groupby, pivot table & cross_tab`

### groupby
Pandas GroupBy is a powerful and versatile function in Python. It allows us to split your data into separate groups to perform calculations for better analysis.
A DataFrame can be grouped on its rows (axis=0) or on its columns (axis=1). Once this is done, a function is applied to each group, producing a new value. Finally, the results of all those function applications are combined into a result object. The shape of the resulting object will usually depend on what is done with the data.

`CUANTITATIVE.groupby(CATEGORICAL).calculation()`

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html

```groupby(df, by, ...)```.
* ```by```   columns on which grouping is to be done
* ```agg```  the aggregate function can be used separately

`groupby the departments and their mean age`

`groupby the departments and their maximum age`

`groupby the departments and their min age`

`groupby: 2+`: Different Education Fields and their Mean Salaries in each of the Department

`more fields`

#### groupby & aggregate

Another way to groupby with agg syntax
https://pandas.pydata.org/docs/reference/api/pandas.core.groupby.DataFrameGroupBy.aggregate.html

- mean
- sum
-count

Suppose we want to calculate the mean of column data1 using the labels of key1. There are several ways to do it. One is to access data1 and call groupby with the column (a String) in key1.
The data (a Series) has been aggregated based on the group key, producing a new String that is now indexed by the unique values ​​of the key1 column. The resulting index has the name 'key1' because the DataFrame column `df['key1']` did.

### Pivot Tables

[groupby vs pivot table](https://towardsdatascience.com/a-comparison-of-groupby-and-pivot-in-pythons-pandas-module-527909e78d6b?source=userActivityShare-4c6d9a33c6-1674605913&_branch_match_id=1146490620103499300&_branch_referrer=H4sIAAAAAAAAA8soKSkottLXz8nMy9bLTU3JLM3VS87P1TfKCvCtKvOvCCpPAgAN4ht%2FIwAAAA%3D%3D)

```pivot_table(df, values=None, index=None, columns=None, aggfunc='mean', ...)```

* We can create a spreadsheet-style pivot table as a DataFrame. The levels in the pivot table will be stored in MultiIndex objects (hierarchical indexes) on the index and columns of the result DataFrame.

`pivot table`: the department and their mean ages

`pivot table`: the department and their max ages

`pivot table`: the department and their min ages

`pivot table`: the department and their min ages

`multi-index pivot table`: Department and Education Field and check the maximum salary values of employees

### Differences between pivot table and groupby function

`groupby`: team mean age by team abbreviation & season.

`pivot_table`: team mean age by team abbreviation & season.

### Crosstab Function

* Compute a simple cross tabulation of two (or more) factors. By default computes a frequency table of the factors unless an array of values and an aggregation function are passed

```crosstab(df, values=None, index=None, columns=None, aggfunc='mean', ...)```

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

## Data combination: mixing dataframes

- https://realpython.com/pandas-merge-join-and-concat/
- https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

### Concat
We join dataframes along axis 0 one below the other. Align columns by label.

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',
                             sep='|', 
                             index_col='user_id')
df.sample()

#### Concatenating on axis 0 (rows)

#### Concatenating on axis 1 (columns)

![sql joins](https://upload.wikimedia.org/wikipedia/commons/9/9d/SQL_Joins.svg)

### Merge

[Merge()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html) is most useful when you want to merge rows that share data.

In [ ]:
import numpy as np
import pandas as pd   
from IPython.display import display_html

In [ ]:
df1 = pd.DataFrame(
    {
        "key1": ["K0", "K0", "K1", "K2"],
        "key2": ["K0", "K1", "K0", "K1"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)


df2 = pd.DataFrame(
    {
        "key1": ["K0", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K0", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)

df3 = pd.DataFrame(
    {
        "key1": ["K90", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K5", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "Y": ["D0", "D70", "D2", "D5"],
    }
)

In [ ]:
df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

In [ ]:
# merge, default is inner

result = pd.merge(df1, df2)
result

In [ ]:
result_on = pd.merge(df1, df2, on=["key1", "key2"])
result_on

#### LEFT Merge

In [ ]:
left_merge = pd.merge(df1, df2, how="left")


df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
left_merge = left_merge.style.set_table_attributes("style='display:inline'").set_caption("left_merge")

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + left_merge._repr_html_(), raw=True)

#### RIGHT Merge

In [ ]:
right_merge = pd.merge(df1, df2, how="right")


df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
right_merge = right_merge.style.set_table_attributes("style='display:inline'").set_caption("right_merge")

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + right_merge._repr_html_(), raw=True)

#### INNER Merge

In [ ]:
inner_merge = pd.merge(df1, df2, how="inner")


df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
inner_merge = inner_merge.style.set_table_attributes("style='display:inline'").set_caption("inner_merge")

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + inner_merge._repr_html_(), raw=True)

#### OUTER Merge

In [ ]:
outer_merge = pd.merge(df1, df2, how="outer")

df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
outer_merge = outer_merge.style.set_table_attributes("style='display:inline'").set_caption("outer_merge")

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + outer_merge._repr_html_(), raw=True)

In [ ]:
#Q:  Merging on an already merged table: merging more than 1 df

result_on_itself = pd.merge(result_on, df3, how="left") #, suffixes=["a", "_right"]
result_on_itself

### Merging / Concatenating in two different columns

In [ ]:
df1_docs = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df2_docs = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})

In [ ]:
df1_styler = df1_docs.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2_docs.style.set_table_attributes("style='display:inline'").set_caption('Right table')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

#### Concatenating in two different columns

In [ ]:
concat_docs = pd.concat([df1_docs, df2_docs], axis=1, keys=["1st table", "2nd table"])

df1_styler = df1_docs.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2_docs.style.set_table_attributes("style='display:inline'").set_caption('Right table')
merge_styler = concat_docs.style.set_table_attributes("style='display:inline'").set_caption('concat_docs')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + merge_styler._repr_html_(), raw=True)

#### Merging in two different columns

In [ ]:
df1_styler = df1_docs.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2_docs.style.set_table_attributes("style='display:inline'").set_caption('Right table')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

In [ ]:
merge_docs = df1_docs.merge(df2_docs, left_on='lkey', right_on='rkey', suffixes = ["_fromleft", "_fromright"])

In [ ]:
merge_docs = df1_docs.merge(df2_docs, left_on='lkey', right_on='rkey', suffixes = ["_from_left", "_from_right"])


df1_styler = df1_docs.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2_docs.style.set_table_attributes("style='display:inline'").set_caption('Right table')
merge_styler = merge_docs.style.set_table_attributes("style='display:inline'").set_caption('merge_docs')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + merge_styler._repr_html_(), raw=True)

In [ ]:
# suffixes: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html

In [ ]:
# concat: putting things together
# join/merge: putting things together THAT ARE RELATED
    # related info in the same place -> reduces redundancy

### Join
The join, unlike the merge, will join the dataframes and where there are no records in the "index" it will put NaN

In [ ]:
import numpy as np
import pandas as pd   
from IPython.display import display_html

In [ ]:
left_df = pd.DataFrame(
    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]
)


right_df = pd.DataFrame(
    {"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"]
)

In [ ]:
df1_styler = left_df.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = right_df.style.set_table_attributes("style='display:inline'").set_caption('Right table')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

In [ ]:
result = left_df.join(right_df, how="inner")

#Rendering the df's in the same line. No need to learn this code

df1_styler = left_df.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = right_df.style.set_table_attributes("style='display:inline'").set_caption('Right table')
df1_df2_merged = result.style.set_table_attributes("style='display:inline'").set_caption('JOIN')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + df1_df2_merged._repr_html_(), raw=True)
#display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

### Differences between join & merge

<figure class="wp-block-table is-style-stripes"><table class="has-fixed-layout"><thead><tr><th><strong>Join Feature</strong></th><th class="has-text-align-center" data-align="center"><strong>join()</strong></th><th class="has-text-align-center" data-align="center"><strong>merge()</strong></th></tr></thead><tbody><tr><td>inner</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>left</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>right</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>outer</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>cross</td><td class="has-text-align-center" data-align="center">X</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Join on Indices</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Join on Columns</td><td class="has-text-align-center" data-align="center">X</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Left on column, right on index</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Left on index, right on column</td><td class="has-text-align-center" data-align="center">X</td><td class="has-text-align-center" data-align="center">Yes</td></tr></tbody></table>

## Export data

`to_csv`

`to_json`

## Pandas usual methods
```python
df.head() # prints the head, default 5 rows
df.tail() # set the tail, default 5 rows
df.describe() # statistical description
df.info() # df information
df.columns # show column
df.index # show index
df.dtypes # show column data types
df.plot() # make a plot
df.hist() # make a histogram
df.col.value_counts() # counts the unique values ​​of a column
df.col.unique() # returns unique values ​​from a column
df.copy() # copies the df
df.drop() # remove columns or rows (axis=0,1)
df.dropna() # remove nulls
df.fillna() # fills nulls
df.shape # dimensions of the df
df._get_numeric_data() # select numeric columns
df.rename() # rename columns
df.str.replace() # replace columns of strings
df.astype(dtype='float32') # change the data type
df.iloc[] # locate by index
df.loc[] # locate by element
df.transpose() # transposes the df
df.T
df.sample(n, frac) # sample from df
df.col.sum() # sum of a column
df.col.max() # maximum of a column
df.col.min() # minimum of one column
df[col] # select column
df.col
df.isnull() # null values
df.isna()
df.notna() # not null values
df.drop_duplicates() # remove duplicates
df.reset_index(inplace=True) # reset the index and overwrite
```

## Further materials

* [Read the docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercises to practice](https://github.com/guipsamora/pandas_exercises)
* [More on merge, concat, and join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). And [even more!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)